app/controllers/requests_controller.rb

    def show
        @request = Request.find(params[:id])
---
SELECT  "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]