app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        if params[:search].present?
            @users = User.near(params[:search], 50, :order => :distance)
          else
            @users =User.all

INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "auth_token", "created_at", "updated_at", "latitude", "longitude") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        user = User.create!(user_params)

SELECT "requests".* FROM "requests"
---
    def profile
        user= User.find_by_auth_token!(request.headers[:token])
        user_requests = Requests.where(user_id: user.id)
        render json: {user:{email: user.email,firstname: user.first_name,lastname:user.last_name, latitude:user.latitude,longitude:user.longitude},requests: user_requests}